#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rancher-mylabs/gh-action-digitalocean/runs/run-FxdecvjWjsRCSW6T

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.server_node_id[1]: Refreshing state... [id=-HM]
random_id.server_node_id[0]: Refreshing state... [id=o5c]
digitalocean_project.k3s_cluster: Refreshing state... [id=03b39bd7-656f-46f9-ad2a-0746737bec7f]
digitalocean_droplet.k3s_server_init[0]: Refreshing state... [id=292960210]
digitalocean_project_resources.k3s_init_server_node[0]: Refreshing state... [id=03b39bd7-656f-46f9-ad2a-0746737bec7f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # digitalocean_project.k3s_cluster has changed
  ~ resource "digitalocean_project" "k3s_cluster" {
        id          = "03b39bd7-656f-46f9-ad2a-0746737bec7f"
        name        = "k3s-cluster"
      ~ resources   = [
          + "do:droplet:292960210",
        ]
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_vpc.k3s_vpc will be created
  + resource "digitalocean_vpc" "k3s_vpc" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "172.10.1.0/24"
      + name       = "k3s-vpc"
      + region     = "sgp1"
      + urn        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "DIGITALOCEAN_TOKEN" but
│ a value was found in file "/terraform/terraform.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @ronnyardi, Action: `pull_request`*